[
  [
    "This topic is about Manchester United's manager, Premier League, the striker for the team, and Liverpool versus Chelsea.",
    "This topic is about market prices and market sales, companies reducing costs, price tags dramatically undercut the major supermarkets, increased sales in the current market, determining a price point for a product, and product sales."
  ],
  [
    "This topic is about Manchester United's manager, Premier League, the striker for the team, and Liverpool versus Chelsea.",
    "This topic is about the disease spreading through close contact, cases of illness or elevated levels of bacteria, and symptoms of the disease such as fever, chills, muscle aches and headaches."
  ],
  [
    "This topic is about Manchester United's manager, Premier League, the striker for the team, and Liverpool versus Chelsea.",
    "This topic is about flooding, dry lake, bridge, high levels of water in the river, and a flooded river."
  ],
  [
    "This topic is about Manchester United's manager, Premier League, the striker for the team, and Liverpool versus Chelsea.",
    "This topic is about firefighters tackled the blaze, wood burning, residents evacuating, flames, spit embers downwind, and burning buildings."
  ],
  [
    "This topic is about Manchester United's manager, Premier League, the striker for the team, and Liverpool versus Chelsea.",
    "This topic is about the senate and congress, congressional pressure, calling one's representative's office, informing a Senate committee, lawmakers setting the record straight, the staffer to the Democratic senator, and federal employee benefits."
  ],
  [
    "This topic is about Manchester United's manager, Premier League, the striker for the team, and Liverpool versus Chelsea.",
    "This topic is about credit, receiving funds, paying money using a credit card, and spending money."
  ],
  [
    "This topic is about Manchester United's manager, Premier League, the striker for the team, and Liverpool versus Chelsea.",
    "This topic is about economic growth involving billion dollar figures showing that the economy is growing as expected globally."
  ],
  [
    "This topic is about Manchester United's manager, Premier League, the striker for the team, and Liverpool versus Chelsea.",
    "This topic is about university researchers, scientific journals, studying humans, and studies by researchers."
  ],
  [
    "This topic is about Manchester United's manager, Premier League, the striker for the team, and Liverpool versus Chelsea.",
    "This topic is about terrorist attacks, islamic terrorism, attacks on the country, terrorist threats, and extremist groups."
  ],
  [
    "This topic is about Manchester United's manager, Premier League, the striker for the team, and Liverpool versus Chelsea.",
    "This topic is about a person found guilty in the trial before a judicial panel, opening a criminal trial against him, a person potentially facing jail time,  receiving a fine, and a suspended prison sentence."
  ],
  [
    "This topic is about Manchester United's manager, Premier League, the striker for the team, and Liverpool versus Chelsea.",
    "This topic is about power plants, using fuel to produce heat, fossil fuels that produce waste, and solar energy."
  ],
  [
    "This topic is about Manchester United's manager, Premier League, the striker for the team, and Liverpool versus Chelsea.",
    "This topic is about how carbon emissions affect global climate change, the Earth’s surface as well as the atmosphere around the Earth, the temperature of the sun, and global temperatures."
  ],
  [
    "This topic is about Manchester United's manager, Premier League, the striker for the team, and Liverpool versus Chelsea.",
    "This topic is about the navy rescuing in the ocean, swimming in the sea, sandy island, dive team rescuing a person, ocean water and fishes in the sea."
  ],
  [
    "This topic is about Manchester United's manager, Premier League, the striker for the team, and Liverpool versus Chelsea.",
    "This topic is about hotel room guests, dinner at the resort, private bar, glass of wine, and the hotel guests sitting down."
  ],
  [
    "This topic is about Manchester United's manager, Premier League, the striker for the team, and Liverpool versus Chelsea.",
    "This topic is about exhibitions on art history, showing original paintings in an art museum, as well as the history section of the library about ancient art versus modern art."
  ],
  [
    "This topic is about Manchester United's manager, Premier League, the striker for the team, and Liverpool versus Chelsea.",
    "This topic is about a bomb explosion attack, people killed in a bombing attack, or injured in the blast, an explosion caused by a bomb, people behind the attack, a car bombing killing and wounding people."
  ],
  [
    "This topic is about Manchester United's manager, Premier League, the striker for the team, and Liverpool versus Chelsea.",
    "This topic is about weight loss and following a healthy diet in order to regulate body fat and blood sugar levels and lose a few pounds of weight following a diet."
  ],
  [
    "This topic is about Manchester United's manager, Premier League, the striker for the team, and Liverpool versus Chelsea.",
    "This topic is about traveling via air, passengers on a flight, airlines offering flexible changes, the world's busiest airport, international transport, and flights being handled by different air traffic controllers."
  ],
  [
    "This topic is about Manchester United's manager, Premier League, the striker for the team, and Liverpool versus Chelsea.",
    "This topic is about people infected with the virus, identifying new cases, the outbreak of measles, public health, new strain of flu, and infected cases."
  ],
  [
    "This topic is about Manchester United's manager, Premier League, the striker for the team, and Liverpool versus Chelsea.",
    "This topic is about eating food at a restaurant, ordering something to drink and serving breakfast, as well as eating chicken, and fruits which are a healthy food."
  ],
  [
    "This topic is about Manchester United's manager, Premier League, the striker for the team, and Liverpool versus Chelsea.",
    "This topic is about the country's president, ruler of the country, President Barack Obama, the White House press conference, the Bush administration, and the former Republican president."
  ],
  [
    "This topic is about Manchester United's manager, Premier League, the striker for the team, and Liverpool versus Chelsea.",
    "This topic is about mobile phones and social networking such as the Facebook app, smart watches, as well as apps containing ads that can be watched on phone screens like Samsung."
  ],
  [
    "This topic is about Manchester United's manager, Premier League, the striker for the team, and Liverpool versus Chelsea.",
    "This topic is about driving vehicles on the road, having to do with traffic and highway speeds, road traffic, and driving."
  ],
  [
    "This topic is about Manchester United's manager, Premier League, the striker for the team, and Liverpool versus Chelsea.",
    "This topic is about a final match to determine which team will win the final round, winning the title to become this year’s champion."
  ],
  [
    "This topic is about Manchester United's manager, Premier League, the striker for the team, and Liverpool versus Chelsea.",
    "This topic is about winning the match by a few points, and how Barcelona had minutes left and had scored before half-time but were able to score a goal at the end."
  ],
  [
    "This topic is about Manchester United's manager, Premier League, the striker for the team, and Liverpool versus Chelsea.",
    "This topic is about medical care, doctors performing surgery, as well as hospital nurses and doctors."
  ],
  [
    "This topic is about Manchester United's manager, Premier League, the striker for the team, and Liverpool versus Chelsea.",
    "This topic is about civil law, marriage, federal law, legal actions, state law, petition, and law for married couples."
  ],
  [
    "This topic is about Manchester United's manager, Premier League, the striker for the team, and Liverpool versus Chelsea.",
    "This topic is about a person arrested and charged, authorities allegations, an investigation, being accused of a crime, being under arrest on one charge, and being under investigation."
  ],
  [
    "This topic is about Manchester United's manager, Premier League, the striker for the team, and Liverpool versus Chelsea.",
    "This topic is about the presidential campaign, the presidential candidate, a state governor, joining a presidential campaign, and a huge impact on political campaigns."
  ],
  [
    "This topic is about Manchester United's manager, Premier League, the striker for the team, and Liverpool versus Chelsea.",
    "This topic is about winter temperatures as opposed to hot weather conditions, cold mornings, and weather forecasts like snow being expected later."
  ],
  [
    "This topic is about Manchester United's manager, Premier League, the striker for the team, and Liverpool versus Chelsea.",
    "This topic is about heir to the throne, Prince William and Prince Harry, the British royal family, the second in line to the throne, and the royal couple."
  ],
  [
    "This topic is about Manchester United's manager, Premier League, the striker for the team, and Liverpool versus Chelsea.",
    "This topic is about high school students and children going to school, education in schools, and parents meeting teachers."
  ],
  [
    "This topic is about Manchester United's manager, Premier League, the striker for the team, and Liverpool versus Chelsea.",
    "This topic is about having kids, becoming a mother, giving birth, children and their parents, and families with children when a baby is born."
  ],
  [
    "This topic is about Manchester United's manager, Premier League, the striker for the team, and Liverpool versus Chelsea.",
    "This topic is about a group composed of militants, fighters joining forces, ongoing violence in the capital, people dead across the country, militants armed with grenades, and a border town."
  ],
  [
    "This topic is about Manchester United's manager, Premier League, the striker for the team, and Liverpool versus Chelsea.",
    "This topic is about military forces and troops in an ongoing war making up the defensive army."
  ],
  [
    "This topic is about Manchester United's manager, Premier League, the striker for the team, and Liverpool versus Chelsea.",
    "This topic is about Ukraine and Russia, calling to fight for Ukraine, euro countries, Russian officials gathering in Moscow, Vladimir Putin, a citizen of the eastern European country, and a bloc of nations within the European Union."
  ],
  [
    "This topic is about Manchester United's manager, Premier League, the striker for the team, and Liverpool versus Chelsea.",
    "This topic is about an east coast storm with high speed winds creating stormy weather on the Atlantic coast, as opposed to the western winds from the Pacific Ocean."
  ],
  [
    "This topic is about Manchester United's manager, Premier League, the striker for the team, and Liverpool versus Chelsea.",
    "This topic is about online internet users, using an iPhone app to surf the internet, computer devices, data plans, and people checking a website on different devices."
  ],
  [
    "This topic is about Manchester United's manager, Premier League, the striker for the team, and Liverpool versus Chelsea.",
    "This topic is about a derby football match, in which the ball hit the post; according to the Arsenal football team’s former manager, they could have snatched victory, but the ball hit the post."
  ],
  [
    "This topic is about Manchester United's manager, Premier League, the striker for the team, and Liverpool versus Chelsea.",
    "This topic is about a court ruling, department of justice, appealing against a court ruling, judge reviewing a case, a court order, and magistrates."
  ],
  [
    "This topic is about Manchester United's manager, Premier League, the striker for the team, and Liverpool versus Chelsea.",
    "This topic is about visiting the pope, roman catholic church, archbishop, and ceremonial meeting for peace."
  ],
  [
    "This topic is about Manchester United's manager, Premier League, the striker for the team, and Liverpool versus Chelsea.",
    "This topic is about Formula 1 racing, the Grand Prix on the race track, Hamilton’s team and the Ferrari team, and collisions during a race."
  ],
  [
    "This topic is about Manchester United's manager, Premier League, the striker for the team, and Liverpool versus Chelsea.",
    "This topic is about flying the plane, the pilot of the aircraft, passengers flying for leisure or work, landing strip, the flight crew, take-offs and landings, aircraft landing, and a jet flying by."
  ],
  [
    "This topic is about Manchester United's manager, Premier League, the striker for the team, and Liverpool versus Chelsea.",
    "This topic is about a rise of taxes benefitting average people, with increased benefits despite their expenses due to a budget increase and decreased consumer goods rates."
  ],
  [
    "This topic is about Manchester United's manager, Premier League, the striker for the team, and Liverpool versus Chelsea.",
    "This topic is about the world cup football championship, Brazil qualifying for the finals, Messi talking about Ronaldo, world champions defending their title, the Nations Cup, the best group of players, real madrid, and a competition for the cup."
  ],
  [
    "This topic is about Manchester United's manager, Premier League, the striker for the team, and Liverpool versus Chelsea.",
    "This topic is about family and friends, and a husband and wife, the couple’s daughter has two brothers."
  ],
  [
    "This topic is about Manchester United's manager, Premier League, the striker for the team, and Liverpool versus Chelsea.",
    "This topic is about a new series based off action films, for which viewers of the film watch for the bonds between the characters."
  ],
  [
    "This topic is about Manchester United's manager, Premier League, the striker for the team, and Liverpool versus Chelsea.",
    "This topic is about a football league having a world championship where each team’s fans are gathered to watch the end of this season’s games culminating in a tournament, to see their favorite football player."
  ],
  [
    "This topic is about Manchester United's manager, Premier League, the striker for the team, and Liverpool versus Chelsea.",
    "This topic is about pop songs, music fans rejoice, a singer and songwriter, the first track on the new album, doing a sound check, and singing along with a prerecorded track."
  ]
]