[
  [
    "This topic is about terrorist attacks, islamic terrorism, attacks on the country, terrorist threats, and extremist groups.",
    "This topic is about credit, receiving funds, paying money using a credit card, and spending money."
  ],
  [
    "This topic is about terrorist attacks, islamic terrorism, attacks on the country, terrorist threats, and extremist groups.",
    "This topic is about heir to the throne, Prince William and Prince Harry, the British royal family, the second in line to the throne, and the royal couple."
  ],
  [
    "This topic is about terrorist attacks, islamic terrorism, attacks on the country, terrorist threats, and extremist groups.",
    "This topic is about a court ruling, department of justice, appealing against a court ruling, judge reviewing a case, a court order, and magistrates."
  ],
  [
    "This topic is about terrorist attacks, islamic terrorism, attacks on the country, terrorist threats, and extremist groups.",
    "This topic is about Formula 1 racing, the Grand Prix on the race track, Hamilton’s team and the Ferrari team, and collisions during a race."
  ],
  [
    "This topic is about terrorist attacks, islamic terrorism, attacks on the country, terrorist threats, and extremist groups.",
    "This topic is about winning the match by a few points, and how Barcelona had minutes left and had scored before half-time but were able to score a goal at the end."
  ],
  [
    "This topic is about terrorist attacks, islamic terrorism, attacks on the country, terrorist threats, and extremist groups.",
    "This topic is about the senate and congress, congressional pressure, calling one's representative's office, informing a Senate committee, lawmakers setting the record straight, the staffer to the Democratic senator, and federal employee benefits."
  ],
  [
    "This topic is about terrorist attacks, islamic terrorism, attacks on the country, terrorist threats, and extremist groups.",
    "This topic is about civil law, marriage, federal law, legal actions, state law, petition, and law for married couples."
  ],
  [
    "This topic is about terrorist attacks, islamic terrorism, attacks on the country, terrorist threats, and extremist groups.",
    "This topic is about traveling via air, passengers on a flight, airlines offering flexible changes, the world's busiest airport, international transport, and flights being handled by different air traffic controllers."
  ],
  [
    "This topic is about terrorist attacks, islamic terrorism, attacks on the country, terrorist threats, and extremist groups.",
    "This topic is about pop songs, music fans rejoice, a singer and songwriter, the first track on the new album, doing a sound check, and singing along with a prerecorded track."
  ],
  [
    "This topic is about terrorist attacks, islamic terrorism, attacks on the country, terrorist threats, and extremist groups.",
    "This topic is about driving vehicles on the road, having to do with traffic and highway speeds, road traffic, and driving."
  ]
]